; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-4-6-22)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	p0-3 - location
	p0-4 - location
	p0-6 - location
	p1-0 - location
	p1-5 - location
	p1-7 - location
	p2-7 - location
	p3-2 - location
	p4-1 - location
	p4-6 - location
	p5-2 - location
	p5-7 - location
	p5-8 - location
	p6-2 - location
	p7-3 - location
	p8-1 - location
	p8-2 - location
	p8-5 - location
	p8-9 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s1)
	(at driver3 s4)
	(at driver4 s2)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s9)
	(empty truck2)
	(at truck3 s4)
	(empty truck3)
	(at truck4 s8)
	(empty truck4)
	(at truck5 s2)
	(empty truck5)
	(at truck6 s6)
	(empty truck6)
	(at package1 s9)
	(at package2 s5)
	(at package3 s5)
	(at package4 s2)
	(at package5 s0)
	(at package6 s8)
	(at package7 s6)
	(at package8 s8)
	(at package9 s5)
	(at package10 s6)
	(at package11 s9)
	(at package12 s4)
	(at package13 s9)
	(at package14 s9)
	(at package15 s6)
	(at package16 s1)
	(at package17 s1)
	(at package18 s7)
	(at package19 s8)
	(at package20 s6)
	(at package21 s4)
	(at package22 s3)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s1 p1-7)
	(path p1-7 s1)
	(path s7 p1-7)
	(path p1-7 s7)
	(path s2 p2-7)
	(path p2-7 s2)
	(path s7 p2-7)
	(path p2-7 s7)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(path s5 p5-7)
	(path p5-7 s5)
	(path s7 p5-7)
	(path p5-7 s7)
	(path s5 p5-8)
	(path p5-8 s5)
	(path s8 p5-8)
	(path p5-8 s8)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(path s7 p7-3)
	(path p7-3 s7)
	(path s3 p7-3)
	(path p7-3 s3)
	(path s8 p8-1)
	(path p8-1 s8)
	(path s1 p8-1)
	(path p8-1 s1)
	(path s8 p8-2)
	(path p8-2 s8)
	(path s2 p8-2)
	(path p8-2 s2)
	(path s8 p8-9)
	(path p8-9 s8)
	(path s9 p8-9)
	(path p8-9 s9)
	(link s0 s6)
	(link s6 s0)
	(link s2 s3)
	(link s3 s2)
	(link s2 s4)
	(link s4 s2)
	(link s2 s7)
	(link s7 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s5)
	(link s5 s3)
	(link s3 s6)
	(link s6 s3)
	(link s3 s8)
	(link s8 s3)
	(link s3 s9)
	(link s9 s3)
	(link s4 s5)
	(link s5 s4)
	(link s4 s9)
	(link s9 s4)
	(link s5 s9)
	(link s9 s5)
	(link s6 s2)
	(link s2 s6)
	(link s7 s0)
	(link s0 s7)
	(link s7 s1)
	(link s1 s7)
	(link s7 s6)
	(link s6 s7)
	(link s8 s6)
	(link s6 s8)
	(link s8 s7)
	(link s7 s8)
	(link s9 s1)
	(link s1 s9)
	(link s9 s6)
	(link s6 s9)
)
	(:goal (and
	(at driver1 s1)
	(at driver2 s9)
	(at driver3 s5)
	(at driver4 s6)
	(at truck1 s7)
	(at truck2 s5)
	(at truck4 s5)
	(at package1 s0)
	(at package2 s2)
	(at package4 s8)
	(at package5 s0)
	(at package7 s3)
	(at package8 s2)
	(at package9 s4)
	(at package10 s1)
	(at package11 s1)
	(at package12 s6)
	(at package13 s1)
	(at package14 s4)
	(at package15 s4)
	(at package16 s3)
	(at package17 s0)
	(at package18 s8)
	(at package19 s4)
	(at package21 s1)
	(at package22 s5)
	))


)

; plan
1. (board-truck driver3 s4 truck3)
   deleted: (at driver3 s4) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 1 of 26
2. (drive-truck driver3 s4 s5 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   goals met: 1 of 26
3. (drive-truck driver3 s5 s3 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s3)
   goals met: 1 of 26
4. (drive-truck driver3 s3 s9 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s9)
   goals met: 1 of 26
5. (load-truck s9 package14 truck3)
   deleted: (at package14 s9)
   added: (in package14 truck3)
   goals met: 1 of 26
6. (load-truck s9 package13 truck3)
   deleted: (at package13 s9)
   added: (in package13 truck3)
   goals met: 1 of 26
7. (load-truck s9 package11 truck3)
   deleted: (at package11 s9)
   added: (in package11 truck3)
   goals met: 1 of 26
8. (load-truck s9 package1 truck3)
   deleted: (at package1 s9)
   added: (in package1 truck3)
   goals met: 1 of 26
9. (load-truck s2 package4 truck5)
   deleted: (at package4 s2)
   added: (in package4 truck5)
   goals met: 1 of 26
10. (board-truck driver4 s2 truck5)
   deleted: (at driver4 s2) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 1 of 26
11. (drive-truck driver4 s2 s3 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s3)
   goals met: 1 of 26
12. (drive-truck driver4 s3 s6 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s6)
   goals met: 1 of 26
13. (load-truck s6 package7 truck5)
   deleted: (at package7 s6)
   added: (in package7 truck5)
   goals met: 1 of 26
14. (drive-truck driver4 s6 s8 truck5)
   deleted: (at truck5 s6)
   added: (at truck5 s8)
   goals met: 1 of 26
15. (load-truck s8 package8 truck5)
   deleted: (at package8 s8)
   added: (in package8 truck5)
   goals met: 1 of 26
16. (drive-truck driver4 s8 s6 truck5)
   deleted: (at truck5 s8)
   added: (at truck5 s6)
   goals met: 1 of 26
17. (load-truck s6 package15 truck5)
   deleted: (at package15 s6)
   added: (in package15 truck5)
   goals met: 1 of 26
18. (load-truck s6 package10 truck5)
   deleted: (at package10 s6)
   added: (in package10 truck5)
   goals met: 1 of 26
19. (board-truck driver2 s1 truck1)
   deleted: (at driver2 s1) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 1 of 26
20. (drive-truck driver4 s6 s3 truck5)
   deleted: (at truck5 s6)
   added: (at truck5 s3)
   goals met: 1 of 26
21. (unload-truck s3 package7 truck5)
   deleted: (in package7 truck5)
   added: (at package7 s3)
   goals met: 2 of 26
22. (load-truck s3 package22 truck5)
   deleted: (at package22 s3)
   added: (in package22 truck5)
   goals met: 2 of 26
23. (load-truck s1 package17 truck1)
   deleted: (at package17 s1)
   added: (in package17 truck1)
   goals met: 2 of 26
24. (drive-truck driver2 s1 s7 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s7)
   goals met: 3 of 26
25. (drive-truck driver4 s3 s5 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s5)
   goals met: 3 of 26
26. (load-truck s5 package9 truck5)
   deleted: (at package9 s5)
   added: (in package9 truck5)
   goals met: 3 of 26
27. (drive-truck driver4 s5 s4 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s4)
   goals met: 3 of 26
28. (unload-truck s4 package9 truck5)
   deleted: (in package9 truck5)
   added: (at package9 s4)
   goals met: 4 of 26
29. (load-truck s4 package21 truck5)
   deleted: (at package21 s4)
   added: (in package21 truck5)
   goals met: 4 of 26
30. (drive-truck driver4 s4 s9 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s9)
   goals met: 4 of 26
31. (drive-truck driver3 s9 s1 truck3)
   deleted: (at truck3 s9)
   added: (at truck3 s1)
   goals met: 4 of 26
32. (load-truck s1 package16 truck3)
   deleted: (at package16 s1)
   added: (in package16 truck3)
   goals met: 4 of 26
33. (drive-truck driver3 s1 s9 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s9)
   goals met: 4 of 26
34. (load-truck s7 package18 truck1)
   deleted: (at package18 s7)
   added: (in package18 truck1)
   goals met: 4 of 26
35. (drive-truck driver2 s7 s8 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s8)
   goals met: 3 of 26
36. (load-truck s8 package19 truck1)
   deleted: (at package19 s8)
   added: (in package19 truck1)
   goals met: 3 of 26
37. (drive-truck driver2 s8 s7 truck1)
   deleted: (at truck1 s8)
   added: (at truck1 s7)
   goals met: 4 of 26
38. (walk driver1 s0 p1-0)
   deleted: (at driver1 s0)
   added: (at driver1 p1-0)
   goals met: 4 of 26
39. (walk driver1 p1-0 s1)
   deleted: (at driver1 p1-0)
   added: (at driver1 s1)
   goals met: 5 of 26
40. (drive-truck driver3 s9 s5 truck3)
   deleted: (at truck3 s9)
   added: (at truck3 s5)
   goals met: 5 of 26
41. (load-truck s5 package2 truck3)
   deleted: (at package2 s5)
   added: (in package2 truck3)
   goals met: 5 of 26
42. (drive-truck driver3 s5 s3 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s3)
   goals met: 5 of 26
43. (unload-truck s3 package16 truck3)
   deleted: (in package16 truck3)
   added: (at package16 s3)
   goals met: 6 of 26
44. (drive-truck driver3 s3 s9 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s9)
   goals met: 6 of 26
45. (drive-truck driver3 s9 s1 truck3)
   deleted: (at truck3 s9)
   added: (at truck3 s1)
   goals met: 6 of 26
46. (unload-truck s1 package13 truck3)
   deleted: (in package13 truck3)
   added: (at package13 s1)
   goals met: 7 of 26
47. (drive-truck driver3 s1 s7 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s7)
   goals met: 7 of 26
48. (drive-truck driver3 s7 s2 truck3)
   deleted: (at truck3 s7)
   added: (at truck3 s2)
   goals met: 7 of 26
49. (drive-truck driver3 s2 s4 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s4)
   goals met: 7 of 26
50. (unload-truck s4 package14 truck3)
   deleted: (in package14 truck3)
   added: (at package14 s4)
   goals met: 8 of 26
51. (load-truck s4 package12 truck3)
   deleted: (at package12 s4)
   added: (in package12 truck3)
   goals met: 8 of 26
52. (drive-truck driver3 s4 s2 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s2)
   goals met: 8 of 26
53. (drive-truck driver3 s2 s6 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s6)
   goals met: 8 of 26
54. (unload-truck s6 package12 truck3)
   deleted: (in package12 truck3)
   added: (at package12 s6)
   goals met: 9 of 26
55. (drive-truck driver3 s6 s0 truck3)
   deleted: (at truck3 s6)
   added: (at truck3 s0)
   goals met: 9 of 26
56. (drive-truck driver3 s0 s3 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   goals met: 9 of 26
57. (walk driver1 s1 p8-1)
   deleted: (at driver1 s1)
   added: (at driver1 p8-1)
   goals met: 8 of 26
58. (walk driver1 p8-1 s8)
   deleted: (at driver1 p8-1)
   added: (at driver1 s8)
   goals met: 8 of 26
59. (board-truck driver1 s8 truck4)
   deleted: (at driver1 s8) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 8 of 26
60. (drive-truck driver1 s8 s3 truck4)
   deleted: (at truck4 s8)
   added: (at truck4 s3)
   goals met: 8 of 26
61. (drive-truck driver1 s3 s5 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s5)
   goals met: 9 of 26
62. (disembark-truck driver1 s5 truck4)
   deleted: (driving driver1 truck4)
   added: (at driver1 s5) (empty truck4)
   goals met: 9 of 26
63. (walk driver1 s5 p1-5)
   deleted: (at driver1 s5)
   added: (at driver1 p1-5)
   goals met: 9 of 26
64. (walk driver1 p1-5 s1)
   deleted: (at driver1 p1-5)
   added: (at driver1 s1)
   goals met: 10 of 26
65. (drive-truck driver3 s3 s0 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   goals met: 10 of 26
66. (unload-truck s0 package1 truck3)
   deleted: (in package1 truck3)
   added: (at package1 s0)
   goals met: 11 of 26
67. (drive-truck driver3 s0 s3 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   goals met: 11 of 26
68. (drive-truck driver3 s3 s2 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   goals met: 11 of 26
69. (unload-truck s2 package2 truck3)
   deleted: (in package2 truck3)
   added: (at package2 s2)
   goals met: 12 of 26
70. (drive-truck driver3 s2 s4 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s4)
   goals met: 12 of 26
71. (drive-truck driver3 s4 s5 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   goals met: 12 of 26
72. (drive-truck driver3 s5 s9 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s9)
   goals met: 12 of 26
73. (drive-truck driver3 s9 s1 truck3)
   deleted: (at truck3 s9)
   added: (at truck3 s1)
   goals met: 12 of 26
74. (unload-truck s1 package11 truck3)
   deleted: (in package11 truck3)
   added: (at package11 s1)
   goals met: 13 of 26
75. (disembark-truck driver3 s1 truck3)
   deleted: (driving driver3 truck3)
   added: (at driver3 s1) (empty truck3)
   goals met: 13 of 26
76. (walk driver3 s1 p1-5)
   deleted: (at driver3 s1)
   added: (at driver3 p1-5)
   goals met: 13 of 26
77. (walk driver3 p1-5 s5)
   deleted: (at driver3 p1-5)
   added: (at driver3 s5)
   goals met: 14 of 26
78. (drive-truck driver4 s9 s1 truck5)
   deleted: (at truck5 s9)
   added: (at truck5 s1)
   goals met: 14 of 26
79. (unload-truck s1 package21 truck5)
   deleted: (in package21 truck5)
   added: (at package21 s1)
   goals met: 15 of 26
80. (drive-truck driver4 s1 s9 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s9)
   goals met: 15 of 26
81. (drive-truck driver2 s7 s6 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s6)
   goals met: 14 of 26
82. (drive-truck driver4 s9 s6 truck5)
   deleted: (at truck5 s9)
   added: (at truck5 s6)
   goals met: 14 of 26
83. (drive-truck driver4 s6 s2 truck5)
   deleted: (at truck5 s6)
   added: (at truck5 s2)
   goals met: 14 of 26
84. (unload-truck s2 package8 truck5)
   deleted: (in package8 truck5)
   added: (at package8 s2)
   goals met: 15 of 26
85. (drive-truck driver4 s2 s6 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s6)
   goals met: 15 of 26
86. (drive-truck driver4 s6 s9 truck5)
   deleted: (at truck5 s6)
   added: (at truck5 s9)
   goals met: 15 of 26
87. (drive-truck driver4 s9 s5 truck5)
   deleted: (at truck5 s9)
   added: (at truck5 s5)
   goals met: 15 of 26
88. (unload-truck s5 package22 truck5)
   deleted: (in package22 truck5)
   added: (at package22 s5)
   goals met: 16 of 26
89. (drive-truck driver4 s5 s3 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s3)
   goals met: 16 of 26
90. (drive-truck driver4 s3 s6 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s6)
   goals met: 16 of 26
91. (drive-truck driver4 s6 s8 truck5)
   deleted: (at truck5 s6)
   added: (at truck5 s8)
   goals met: 16 of 26
92. (unload-truck s8 package4 truck5)
   deleted: (in package4 truck5)
   added: (at package4 s8)
   goals met: 17 of 26
93. (drive-truck driver4 s8 s3 truck5)
   deleted: (at truck5 s8)
   added: (at truck5 s3)
   goals met: 17 of 26
94. (drive-truck driver4 s3 s6 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s6)
   goals met: 17 of 26
95. (drive-truck driver4 s6 s9 truck5)
   deleted: (at truck5 s6)
   added: (at truck5 s9)
   goals met: 17 of 26
96. (drive-truck driver4 s9 s1 truck5)
   deleted: (at truck5 s9)
   added: (at truck5 s1)
   goals met: 17 of 26
97. (unload-truck s1 package10 truck5)
   deleted: (in package10 truck5)
   added: (at package10 s1)
   goals met: 18 of 26
98. (drive-truck driver4 s1 s9 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s9)
   goals met: 18 of 26
99. (drive-truck driver4 s9 s4 truck5)
   deleted: (at truck5 s9)
   added: (at truck5 s4)
   goals met: 18 of 26
100. (unload-truck s4 package15 truck5)
   deleted: (in package15 truck5)
   added: (at package15 s4)
   goals met: 19 of 26
101. (disembark-truck driver4 s4 truck5)
   deleted: (driving driver4 truck5)
   added: (at driver4 s4) (empty truck5)
   goals met: 19 of 26
102. (walk driver4 s4 p4-6)
   deleted: (at driver4 s4)
   added: (at driver4 p4-6)
   goals met: 19 of 26
103. (walk driver4 p4-6 s6)
   deleted: (at driver4 p4-6)
   added: (at driver4 s6)
   goals met: 20 of 26
104. (drive-truck driver2 s6 s0 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s0)
   goals met: 20 of 26
105. (unload-truck s0 package17 truck1)
   deleted: (in package17 truck1)
   added: (at package17 s0)
   goals met: 21 of 26
106. (drive-truck driver2 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 21 of 26
107. (drive-truck driver2 s3 s9 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s9)
   goals met: 21 of 26
108. (drive-truck driver2 s9 s4 truck1)
   deleted: (at truck1 s9)
   added: (at truck1 s4)
   goals met: 21 of 26
109. (unload-truck s4 package19 truck1)
   deleted: (in package19 truck1)
   added: (at package19 s4)
   goals met: 22 of 26
110. (drive-truck driver2 s4 s9 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s9)
   goals met: 22 of 26
111. (disembark-truck driver2 s9 truck1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s9) (empty truck1)
   goals met: 23 of 26
112. (board-truck driver2 s9 truck2)
   deleted: (at driver2 s9) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 22 of 26
113. (unload-truck s9 package18 truck1)
   deleted: (in package18 truck1)
   added: (at package18 s9)
   goals met: 22 of 26
114. (load-truck s9 package18 truck2)
   deleted: (at package18 s9)
   added: (in package18 truck2)
   goals met: 22 of 26
115. (drive-truck driver2 s9 s5 truck2)
   deleted: (at truck2 s9)
   added: (at truck2 s5)
   goals met: 23 of 26
116. (drive-truck driver2 s5 s3 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s3)
   goals met: 22 of 26
117. (drive-truck driver2 s3 s8 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s8)
   goals met: 22 of 26
118. (disembark-truck driver2 s8 truck2)
   deleted: (driving driver2 truck2)
   added: (at driver2 s8) (empty truck2)
   goals met: 22 of 26
119. (unload-truck s8 package18 truck2)
   deleted: (in package18 truck2)
   added: (at package18 s8)
   goals met: 23 of 26
120. (walk driver2 s8 p8-9)
   deleted: (at driver2 s8)
   added: (at driver2 p8-9)
   goals met: 23 of 26
121. (walk driver2 p8-9 s9)
   deleted: (at driver2 p8-9)
   added: (at driver2 s9)
   goals met: 24 of 26
122. (board-truck driver2 s9 truck1)
   deleted: (at driver2 s9) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 23 of 26
123. (drive-truck driver2 s9 s6 truck1)
   deleted: (at truck1 s9)
   added: (at truck1 s6)
   goals met: 23 of 26
124. (drive-truck driver2 s6 s8 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s8)
   goals met: 23 of 26
125. (disembark-truck driver2 s8 truck1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s8) (empty truck1)
   goals met: 23 of 26
126. (walk driver2 s8 p8-9)
   deleted: (at driver2 s8)
   added: (at driver2 p8-9)
   goals met: 23 of 26
127. (walk driver2 p8-9 s9)
   deleted: (at driver2 p8-9)
   added: (at driver2 s9)
   goals met: 24 of 26
128. (walk driver3 s5 p5-8)
   deleted: (at driver3 s5)
   added: (at driver3 p5-8)
   goals met: 23 of 26
129. (walk driver3 p5-8 s8)
   deleted: (at driver3 p5-8)
   added: (at driver3 s8)
   goals met: 23 of 26
130. (board-truck driver3 s8 truck2)
   deleted: (at driver3 s8) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 23 of 26
131. (drive-truck driver3 s8 s3 truck2)
   deleted: (at truck2 s8)
   added: (at truck2 s3)
   goals met: 23 of 26
132. (drive-truck driver3 s3 s5 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   goals met: 24 of 26
133. (disembark-truck driver3 s5 truck2)
   deleted: (driving driver3 truck2)
   added: (at driver3 s5) (empty truck2)
   goals met: 25 of 26
134. (walk driver3 s5 p5-8)
   deleted: (at driver3 s5)
   added: (at driver3 p5-8)
   goals met: 24 of 26
135. (walk driver3 p5-8 s8)
   deleted: (at driver3 p5-8)
   added: (at driver3 s8)
   goals met: 24 of 26
136. (board-truck driver3 s8 truck1)
   deleted: (at driver3 s8) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 24 of 26
137. (drive-truck driver3 s8 s7 truck1)
   deleted: (at truck1 s8)
   added: (at truck1 s7)
   goals met: 25 of 26
138. (disembark-truck driver3 s7 truck1)
   deleted: (driving driver3 truck1)
   added: (at driver3 s7) (empty truck1)
   goals met: 25 of 26
139. (walk driver3 s7 p5-7)
   deleted: (at driver3 s7)
   added: (at driver3 p5-7)
   goals met: 25 of 26
140. (walk driver3 p5-7 s5)
   deleted: (at driver3 p5-7)
   added: (at driver3 s5)
   goals met: 26 of 26
